tests/load-tests/artillery/ridely-service/reports-reference/no-chacing/list-drivers-60-10-normal.txt
All VUs finished. Total time: 1 minute, 2 seconds

--------------------------------
Summary report @ 15:34:26(-0300)
--------------------------------

errors.ETIMEDOUT: .............................................................. 132
http.codes.200: ................................................................ 468
http.downloaded_bytes: ......................................................... 1135368
http.request_rate: ............................................................. 10/sec
http.requests: ................................................................. 600
http.response_time:
  min: ......................................................................... 49
  max: ......................................................................... 9882
  mean: ........................................................................ 2605.4
  median: ...................................................................... 361.5
  p95: ......................................................................... 9047.6
  p99: ......................................................................... 9801.2
http.response_time.2xx:
  min: ......................................................................... 49
  max: ......................................................................... 9882
  mean: ........................................................................ 2605.4
  median: ...................................................................... 361.5
  p95: ......................................................................... 9047.6
  p99: ......................................................................... 9801.2
http.responses: ................................................................ 468
vusers.completed: .............................................................. 468
vusers.created: ................................................................ 600
vusers.created_by_name.List Drivers (Authenticated): ........................... 600
vusers.failed: ................................................................. 132
vusers.session_length:
  min: ......................................................................... 51.2
  max: ......................................................................... 9886.7
  mean: ........................................................................ 2617.9
  median: ...................................................................... 391.6
  p95: ......................................................................... 9047.6
  p99: ......................................................................... 9801.2