tests/load-tests/artillery/ridely-service/reports-reference/no-chacing/list-drivers-60-10-scalated.txt
All VUs finished. Total time: 1 minute, 2 seconds

--------------------------------
Summary report @ 15:36:22(-0300)
--------------------------------

http.codes.200: ................................................................ 595
http.codes.500: ................................................................ 5
http.downloaded_bytes: ......................................................... 1444175
http.request_rate: ............................................................. 9/sec
http.requests: ................................................................. 600
http.response_time:
  min: ......................................................................... 37
  max: ......................................................................... 451
  mean: ........................................................................ 101.2
  median: ...................................................................... 79.1
  p95: ......................................................................... 228.2
  p99: ......................................................................... 368.8
http.response_time.2xx:
  min: ......................................................................... 43
  max: ......................................................................... 451
  mean: ........................................................................ 101.3
  median: ...................................................................... 79.1
  p95: ......................................................................... 228.2
  p99: ......................................................................... 368.8
http.response_time.5xx:
  min: ......................................................................... 37
  max: ......................................................................... 149
  mean: ........................................................................ 85
  median: ...................................................................... 46.1
  p95: ......................................................................... 147
  p99: ......................................................................... 147
http.responses: ................................................................ 600
vusers.completed: .............................................................. 600
vusers.created: ................................................................ 600
vusers.created_by_name.List Drivers (Authenticated): ........................... 600
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 39.4
  max: ......................................................................... 462.5
  mean: ........................................................................ 107.6
  median: ...................................................................... 83.9
  p95: ......................................................................... 242.3
  p99: ......................................................................... 376.2